{"data":{"site":{"siteMetadata":{"title":"Carson Covell","url":"https://carsoncovell.com/","description":"Carson Covell is a web developer living in Atlanta, GA."}},"markdownRemark":{"html":"<p>I look down towards my watch, it reads 5:55pm. <em>Whew, I made it on time</em>. I enter the room and am greeted by five smiling students. On their faces I see pride mixed with anxiety and excitement. Over the last ten weeks, they have worked many hours learning HTML, CSS and little JavaScript in order to build their own websites.</p>\n<p>I walk around the tables, looking at each of their web pages. <em>Wow. They have come so far</em>, I think to myself. A bittersweet feeling passes through my heart, for this is their last Refugee Coding class.</p>\n<hr>\n<p>When I entered the Refugee Career Center on the first day of class, I wasn’t sure what I had signed myself up for. At the time, I was searching for meaning in my work and questioning the worth of the web development career I’d committed myself towards.</p>\n<p>The Refugee Coding Class, or <a href=\"https://refcode.org/\">RefCode</a>, is a ten-week web development class for refugees in Clarkston, GA. Clarkston is a refugee resettlement city; often referred to as “the most diverse square mile in America” <a href=\"%22the%20most%20diverse%20square%20mile%20in%20America%22\">1</a>, the small town with a population around of 8,000 occupants is filled with people from across the globe. Asia, South America, Africa, the Middle East, any country the U.S. has accepted refugees from in the last thirty years is likely represented in Clarkston, GA.</p>\n<p>Over the course of the class, students learn HTML, CSS, JavaScript and a few software development practices like Kanban and Github. The class builds up to a final project, or deliverable: a personal website.</p>\n<p>I love that the student’s ultimate goal is to build their own website. A website is a truly powerful thing to control, especially for people who come from backgrounds so different from the United States. A website is a place where student’s can share their experiences and express who they are. </p>\n<p>One student’s website header read, “Welcome to my world”. It’s a simple phrase, but it struck me deeply. Teaching  someone to build a website, is also giving them a platform to express who they are and a means to share with the entire world. </p>\n<p>Helping students learn to code has reminded me how powerful and magical the web is.</p>\n<p>My involvement with the class has impacted me on more than just a career level, though. As I became closer with particular students, they began to share their stories. It’s one thing to hear about the experiences of refugees on the news, and quite another to have someone you consider a friend look you in the eye and tell you what they’ve been through—to show you a photo of them playing soccer in a field with their kids and then swipe over to a photo of their house crumbled to pieces after being destroyed in a bombing.</p>\n<p>Refugees have faced pain and suffering that any American I know cannot comprehend. In some cases they may have lost their culture, career and family - all at the same time. They were forced to leave their countries because of conflict that was no fault of their own.</p>\n<p>Since volunteering at RefCode, I now view my life through a different lens. It is impossible to be ungrateful for the life and privileges I was born with. I now see the struggles that once frustrated or upset me as merely inconsequential and instead am thankful for all that is going well. I am a happier person.</p>\n<hr>\n<p>While my first class has come to an end, it is not the end of RefCode nor my involvement with the program. I’m super excited for the next class which begins May 1st and hope to be even more involved.</p>\n<p>If you’re still reading this and are interested in getting involved with the program please reach out to me or Brenton Strine and we can send over the relevant info. You won’t regret it 😃</p>","frontmatter":{"date":"April 13, 2019","path":"/blog/the-refugee-coding-class","title":"The Refugee Coding Class","image":null}}},"pageContext":{}}