{"data":{"site":{"siteMetadata":{"title":"Carson Covell","url":"https://carsoncovell.com/","description":"Carson Covell is a web developer living in Atlanta, GA."}},"markdownRemark":{"html":"<p>“Excuse me, would you mind opening the window?” The woman sitting next to me on the plane asked, gesturing towards the window which had remained closed since the plane began taxiing back in Denver.</p>\n<p>“Sure!” As I opened the window, the bright reflection of sunlight on the tops of clouds blinded me. I paused, allowing my eyes to dilate to the new light source. I looked back to the woman next to me, her gaze suggested I continue opening the window. It’s just clouds, I thought to myself, but obliged.</p>\n<p>As I continued to open the window shade, more flat clouds became visible. As the shade reached just over half way open, a glorious mountain peak showed itself through the clouds. Stunned, I looked back at the women in amazement. She wasn’t all that surprised. Maybe she had made this flight before.</p>\n<p>“What mountain is that?” I asked.</p>\n<p>“Mount Hood,” she responded simply.</p>\n<p>The fantasy of the moment faded. I had heard of Mount Hood; it wasn’t that tall. Then, I remembered the news of the summer: wildfires. The shining clouds weren’t clouds at all, but smoke, rather, that had blown north from the fires raging in California.</p>\n<p>A bit shaken, having fallen from the fantasy world of mountains above clouds to the grimmer reality of fires raging throughout the west, I pulled my phone out and snapped a photo, hoping that my all-powerful iPhone would capture a sliver of the impressiveness that lie before me.</p>\n<p>—</p>\n<p>XOXO was the first conference I’d ever attended, and to be honest, it is not really a conference at all. XOXO describes itself as, “…an experimental festival for independent artists and creators who work on the internet.” A description which avoids defining the content of the festival and instead focuses on who the festival is for. Based on my singular experience attending the festival, I would define XOXO more as a celebration than a conference. A celebration of creativity, humanity, and the emotions that come along with living and working on the internet.</p>\n<p>I have always been afraid to live on the internet. Maybe I grew up a little too late to see the internet before it was dangerous, or maybe a little too early, before socializing became online first and in-person second. Whatever the case, I’m terrified of posting to the internet and this weekend I learned what I am missing out on by not overcoming this fear.</p>\n<p>At XOXO I had the opportunity to meet brilliant writers, illustrators, indie developers and designers whose careers depend on the internet. I looked on as long-time internet friends met in person for the first time, embracing with a hug and warm smiles. XOXO attempts to share the experiences of a diverse set of people. The internet includes nearly everyone, therefore it provides an avenue for meeting and building relationships with a more diverse set of people than any physical location will ever be able to.</p>\n<p>XOXO was great to me. For the first time I began to see the creative social spaces of the internet as more of a community instead of a competition; a competition which I have never wanted to be a part of. I met people whose work I admired on Dribbble and Twitter. I saw people whose podcasts I had listened to and adored. And they were real people! Looking just as socially anxious and awkward as I was. They weren’t creating their work for numbers, but rather because they enjoy creating and want to connect and share with others.</p>\n<p>I’ve been asked many times since returning, “so… what did you learn?” I find it difficult to respond to this question with a straight answer because my experience was less about learning any specific concept and more about understanding the world of the internet and being inspired by amazing people.</p>\n<p>I saw the power of comedy in educating people on topics which they would typically be averse to. Nobody can resist paying attention to what is being said when the entire arena is laughing hysterically.</p>\n<p>I’ve begun to understand the importance of identity, and that it is something I am allowed to have. We are all different, and oppressing identity leads to a lack of diversity. Attempting to shape myself into the “default” person that I’m “supposed” to be based on the physical characteristics I was born with, is a disservice to myself and to others. Showcasing my identity and being myself sets the example that others can do the same. Myself and those who look like me do not have to aspire to the traditional white male characteristics which come with so many consequences for people of other groups.</p>\n<p>I’ve begun to understand the necessity of inviting a diverse set of speakers who bring drastically different experiences to the stage. This is a sentiment I have always believed, but unfortunately never experienced for myself. We all need to grow in different ways, and by inviting a diverse set of speakers and attendees, opportunity for growth is available to everyone.</p>\n<p>I left the festival inspired to create, but more importantly, inspired to connect with other people. Networking has never appealed to me. In my experience, networking events have always been about talking with uninteresting people about uninteresting things. Networking at XOXO was different. It just felt like making new friends! Because that’s really what it was.</p>\n<p>I began to internalize that creative works are important to other people in ways that are often hard to imagine. They are not simply self-indulgent or solely for profit. Creative works have the ability to inspire others. Creativity breeds creativity. It is impossible to know what a piece of work may inspire in another person, or even in your future self.</p>\n<p>I’ve begun to understand that making mistakes on the internet is okay, albeit still terrifying. Everyone doubts themselves intensely, even those who are highly successful and talented . The best course of action is to own your mistakes and improve openly.</p>\n<p>When I left for Portland, I didn’t know what to expect. It was a new city, a new climate, and a hell of a lot of new people. After our plane landed in Portland and I waited for my bag to be delivered around the baggage claim carrousel, I stood and wondered: is the internet really a wild fire ablaze, burning everything in its path? Or are there still pockets of wonder, fantasy, and creativity, attempting to rise above the drifting smoke and inspiring others to join in and fight to keep this world a magical place.</p>","frontmatter":{"date":"October 01, 2018","path":"/blog/xoxo-fest-2018","title":"XOXO Fest 2018","image":null}}},"pageContext":{}}