{"data":{"markdownRemark":{"html":"<p>One of my goals in life is to visit all of America’s National Parks. They offer an incredibly diverse set of landscape spanning desert, to high mountains, beautiful forest and low lying swap. We are so lucky to have these lands and ecosystems preserved that I can’t help but feel a responsibility to visit and share what the parks have to offer.</p>\n<p>A week ago, I had the opportunity to visit Big Bend National Park. There was a highly regarded conference happening in Austin and some friends of mine, Matt and Jonathan planned to use some PTO to spend three days at Big Bend before the conference. When they asked if I wanted to tag along, I couldn’t help but want to.</p>\n<p>Big Bend lies on the U.S.-Mexico border is two and a half hours drive away from the nearest town with a grocery store and about eight hours drive from Austin. The park encompasses [size] acres. [more history]</p>\n<p>Considering the significant travel commitment required to visit the park, I figured I wouldn’t have an opportunity to visit again for the foreseeable future.</p>\n<p>Our plan was to hike the Outer Loop. The 32 mile trip would take us three days for our city legs to hike. On paper it didn’t sounds too strenuous, approximately 10 miles per day, but it would be an understatement to say that any of us were in good hiking shape. On top of the distance we would also have to carry enough water to last us for the first two days. The Park Service recommends a gallon a day per person, which meant we’d have to carry 16.5 pounds of water on top of the rest of our gear.</p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_BBADC2FA0CDB08BF625CFAE1CB0CBB82FDB55E3EFD87763A7654A9D19CE22E17_1544885556261_Screen+Shot+2018-12-15+at+9.52.03+AM.png\" alt=\"Profile of the Outer Mountain Loop.\"></p>\n<h2>Day One</h2>\n<p>On Sunday morning, we packed up our car camping site and made our way to the visitor center to pick up the backcountry permit. By the time we hit the trail it was after 10:00am, not great when you have to cover eleven miles and the short winter days mean darkness sets in around 5:30pm.</p>\n<p>The hiking waisted no time kicking our butts. With our packs weighing heavy on our shoulders and hips, the three mile Pinnacles Trail felt twice as long. We rested leisurely at the the top of the ridge we had just hiked before continuing on to the Juniper Canyon trail. After completing the climb we took a break to enjoy a late lunch.</p>\n<p>As we wrapped up, I checked my phone to see how far we had left to go. Oh. We still had 6 miles to go and it was already 2:30pm, three hours before darkness. This added a bit of urgency to our step as we had no interest in hiking around after dark - the ranger had told us that morning how common mountain lion are in the area.</p>\n<p>After descending the mountain ridge we had climbed that morning, we entered a field of golden grass. The sun was starting to get low at this point, lighting the field with a warm glow. We stopped to take pictures, but continued on after realizing the sunny spot we stood in had been taken over by shadow in only a few minutes. We were now in a race with the sun.</p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_BBADC2FA0CDB08BF625CFAE1CB0CBB82FDB55E3EFD87763A7654A9D19CE22E17_1544886703678_BBA16B16-E62D-444E-AAA0-C2C17B739529.JPG\" alt=\"Golden grasslands.\"></p>\n<p>In the mountains, days can feel even shorter. If you are in a valley the surrounding mountains serve to raise the horizon high above its natural level. Even though it was only 4:30pm, the sun sat only a small ways above the nearby western mountains. Once the sun dropped, below the the ridge line we would have about an hour more of light and the temperate would begin to drop very quickly.</p>\n<p>As fatigue was beginning to set in, we arrived at the end of the Juniper Canyon Trail. Marked by a dirt parking lot, we had completed our planned hiking for the day, but had yet to locate a suitable campsite. After considering pitching our tents in the parking lot, we decided to carry on until we reached the first proper site. Luckily, there was one only a few hundred feet further up the trail.</p>\n<p>After a wonderful sunset and a rehydrated meal for dinner, we hit the hay at 7:30pm. It was dark and we were exhausted. With a alarms set for 7:00am sunrise the next morning we settled in for a much needed twelve hour coma.</p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_BBADC2FA0CDB08BF625CFAE1CB0CBB82FDB55E3EFD87763A7654A9D19CE22E17_1544888232716_2090E848-18F3-49CA-B6E4-E9D004B20BE8.JPG\" alt=\"✌🏼📸\"></p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_BBADC2FA0CDB08BF625CFAE1CB0CBB82FDB55E3EFD87763A7654A9D19CE22E17_1544888925654_B195582D-364B-4C43-8946-25E862399DEE.JPG\">\n<img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_BBADC2FA0CDB08BF625CFAE1CB0CBB82FDB55E3EFD87763A7654A9D19CE22E17_1544888925312_89F51CB9-1544-4874-8AA2-35CCB9B7BB72.JPG\"></p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_BBADC2FA0CDB08BF625CFAE1CB0CBB82FDB55E3EFD87763A7654A9D19CE22E17_1544888121671_IMG_6996.JPG\" alt=\"Looking back a the ridge we climbed and descended.\"></p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_BBADC2FA0CDB08BF625CFAE1CB0CBB82FDB55E3EFD87763A7654A9D19CE22E17_1544887953257_IMG_6995.JPG\" alt=\"End of Juniper Canyon Trail sit.\"></p>\n<p><figure class=\"gatsby-resp-image-figure\" style=\"\">\n    <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/ed6514c0045c6cc18b652fa307794ed6/4c478/sunset-tones.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n    <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 660px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 125.16556291390728%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAZABQDASIAAhEBAxEB/8QAGQAAAwADAAAAAAAAAAAAAAAAAAECAwQG/8QAFgEBAQEAAAAAAAAAAAAAAAAAAAEC/9oADAMBAAIQAxAAAAHcdtqSROfhNEYw/8QAHBAAAgICAwAAAAAAAAAAAAAAAAEDEhExAhAh/9oACAEBAAEFAqlUVRlF+CHPEj3rItj3/8QAGBEAAgMAAAAAAAAAAAAAAAAAAAEQERL/2gAIAQMBAT8ByUp//8QAFxEAAwEAAAAAAAAAAAAAAAAAAAESEP/aAAgBAgEBPwGinv8A/8QAGhAAAgIDAAAAAAAAAAAAAAAAACABAiExMv/aAAgBAQAGPwJM2g6Nt//EAB4QAAIBBAMBAAAAAAAAAAAAAAABERAxUYEhYXGh/9oACAEBAAE/IYZ+HodDFmHYDY0hrrknI9jdQ7Uv/9oADAMBAAIAAwAAABDM9UH/xAAVEQEBAAAAAAAAAAAAAAAAAAABIP/aAAgBAwEBPxBEX//EABcRAAMBAAAAAAAAAAAAAAAAAAAQEWH/2gAIAQIBAT8QsyLV/8QAHRABAAIBBQEAAAAAAAAAAAAAAQBRESExQZGxgf/aAAgBAQABPxA5esFi+Qg1UAXBaOTE7CUR2TTxgVDDScXHDdRrE9J6Tcn/2Q=='); background-size: cover; display: block;\"\n    ></span>\n    <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;\"\n        alt=\"Moar title testing\"\n        title=\"Sunset mood.\"\n        src=\"/static/ed6514c0045c6cc18b652fa307794ed6/021ca/sunset-tones.jpg\"\n        srcset=\"/static/ed6514c0045c6cc18b652fa307794ed6/1ac00/sunset-tones.jpg 165w,\n/static/ed6514c0045c6cc18b652fa307794ed6/ab733/sunset-tones.jpg 330w,\n/static/ed6514c0045c6cc18b652fa307794ed6/021ca/sunset-tones.jpg 660w,\n/static/ed6514c0045c6cc18b652fa307794ed6/86605/sunset-tones.jpg 990w,\n/static/ed6514c0045c6cc18b652fa307794ed6/6ab68/sunset-tones.jpg 1320w,\n/static/ed6514c0045c6cc18b652fa307794ed6/0a3a7/sunset-tones.jpg 1980w,\n/static/ed6514c0045c6cc18b652fa307794ed6/4c478/sunset-tones.jpg 2416w\"\n        sizes=\"(max-width: 660px) 100vw, 660px\"\n      />\n  </span>\n  </a>\n    <figcaption class=\"gatsby-resp-image-figcaption\">Sunset mood.</figcaption>\n  </figure></p>\n<p><figure class=\"gatsby-resp-image-figure\" style=\"\">\n    <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/3805e21a5e816cf780d68575202bf26c/a7172/sunset-ridge.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n    <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 660px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 74.57010582010581%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAPABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAMFAv/EABUBAQEAAAAAAAAAAAAAAAAAAAEC/9oADAMBAAIQAxAAAAFyZemqZLE//8QAGRAAAgMBAAAAAAAAAAAAAAAAABEBAgMT/9oACAEBAAEFAp1yg70OlBjGf//EABYRAAMAAAAAAAAAAAAAAAAAAAABEf/aAAgBAwEBPwGIiP/EABYRAQEBAAAAAAAAAAAAAAAAAAAREv/aAAgBAgEBPwGtP//EABgQAAIDAAAAAAAAAAAAAAAAAAAgMTJR/9oACAEBAAY/ArGEp//EABsQAQACAgMAAAAAAAAAAAAAAAEAERBxIUFR/9oACAEBAAE/IegOoI0jF/jZDhLY/wD/2gAMAwEAAgADAAAAEBjf/8QAFREBAQAAAAAAAAAAAAAAAAAAARD/2gAIAQMBAT8QIX//xAAWEQEBAQAAAAAAAAAAAAAAAAAAARH/2gAIAQIBAT8QttP/xAAcEAEBAAICAwAAAAAAAAAAAAABEQAhMXFBUYH/2gAIAQEAAT8QsFAyBceenKW4bPyTCQhOslNE514y3YodZ//Z'); background-size: cover; display: block;\"\n    ></span>\n    <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;\"\n        alt=\"Campsite views!\"\n        title=\"Campsite views!\"\n        src=\"/static/3805e21a5e816cf780d68575202bf26c/021ca/sunset-ridge.jpg\"\n        srcset=\"/static/3805e21a5e816cf780d68575202bf26c/1ac00/sunset-ridge.jpg 165w,\n/static/3805e21a5e816cf780d68575202bf26c/ab733/sunset-ridge.jpg 330w,\n/static/3805e21a5e816cf780d68575202bf26c/021ca/sunset-ridge.jpg 660w,\n/static/3805e21a5e816cf780d68575202bf26c/86605/sunset-ridge.jpg 990w,\n/static/3805e21a5e816cf780d68575202bf26c/6ab68/sunset-ridge.jpg 1320w,\n/static/3805e21a5e816cf780d68575202bf26c/0a3a7/sunset-ridge.jpg 1980w,\n/static/3805e21a5e816cf780d68575202bf26c/a7172/sunset-ridge.jpg 3024w\"\n        sizes=\"(max-width: 660px) 100vw, 660px\"\n      />\n  </span>\n  </a>\n    <figcaption class=\"gatsby-resp-image-figcaption\">Campsite views!</figcaption>\n  </figure></p>\n<h2>Day Two</h2>\n<p>Ring ring. iPhone alarms buzzed us awake at 7:00am. Has it really been eleven hours already? When I went to bed that night, I was worried I would wake in the middle of the night and would not be able to fall back asleep. The cool morning air nipped my nose while the rest of my body stayed warm inside my sleeping bag. It was hardly light out, surely the sunrise hadn’t started yet.</p>\n<p>For good measure, I peaked my head out of the tent. What I saw took my breath away. The sun still below horizon produced the most beautiful sky I’ve ever seen. A vibrant gradient of yellow, orange, pink and dark purple. Quickly, I grabbed my camera and threw warm clothes on. Still dark, it was hard to build a composition with anything other than the sky viewable. With color this vibrant, I suppose that is okay :)</p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_BBADC2FA0CDB08BF625CFAE1CB0CBB82FDB55E3EFD87763A7654A9D19CE22E17_1545149784128_794BE233-2EFC-4209-BA05-54D62D9CF2E4.JPG\"></p>\n<p>Dazed by the beautiful morning, Matt, Jonathan and I spent the rest of the morning taking photos until the last of the color faded. Afterwards we settled for a relaxing breakfast of Clif Bars, Oatmeal and of course, coffee. By the time we had pack and we ready to leave, it was 10:15am.</p>\n<p>“Should be fine,” we told ourselves. Looking at the elevation profile today’s hiking should be much easier than the day before. We started off and quickly became aware that the environment of the day was going to be harsher than the previous day. We had dropped a 1000’ of elevation, enough to change the landscape from dry forest to true desert. There were no trees in sight and no mountain walls to block of the sun. The temperature was only 70º, but after only an hour of hiking we were HOT.</p>\n<p>While the landscape profile for the day looked much flatter than the day before, what the approximation had forgone was the constant ascent and decent of the trail. While our overall elevation gain wasn’t much, the endlessly rising hills became a mental and physical struggle. When we’d reach the top of one hill, we’d see another ahead higher, but first requiring a decent almost as far down as the hill we had just climbed. Day Two was proving to be more strenuous than expected.</p>\n<p>One other complication added itself to our list of perseverances. It seemed that in the desert every single plant had become spiky. Even the friendliest bushed would grab and scrape as we brushed through them. The pain was annoying, producing internal screams every few steps, but the thought of wearing full pants in this heat seemed too much to handle - so we continued on, legs reddening as we pushed on.</p>\n<p>Unable to find a shade for lunch, we parked it on top of a hill. Refueled we put our heads down and climbed the last few large hills before the the trail would tilt to a net downhill. A few hours later, as we breached the top of a large hill we were greeted with an unexpected panoramic view. It was grand and inspiring. This is what a National Park should look like, I remember thinking to myself. A rather [lame] comment I admit, I was a bit grumpy from our long desert slog.</p>\n<p>A view the viewpoint certainly deserved a photo, even in the harsh afternoon light, and besides it marked an accomplishment. The trail appeared all downhill from here. I dropped my pack from my shoulders and went to grab my camera - but it wasn’t there!</p>\n<p>Anxiety began to creep into my mind. Had I left it at the lunch location? That was two hours back. We had stopped about a mile back for water, but I couldn’t remember if I’d had a reason to open my pack. One of the benefits of hiking with engineers is that they’re extremely good at emergency response planning. Immediately Matt and Jonathan mapped out all the possible situations and what the response would be to each. We decided that Matt would stay at the current location and look after our bags while Jonathan and I ran back a mile to our last stopping point. Regardless of whether the camera was there or not, we’d have to return to the viewpoint and continue on. Because of our late start, our chances of setting up camp before dark were already slim.</p>\n<p>As we ran back, the anxiety began to leave me. I haven’t ran in a while, I’d forgotten its therapeutic nature. As my mind cleared, I became more and more confident that the camera would be at our resting stop. By the time we rounded the last corner, I was certain it would be lying on the ground, wrapped in my winter hat for protection. Sure enough, it was. Jonathan made me pose for a photo.</p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_BBADC2FA0CDB08BF625CFAE1CB0CBB82FDB55E3EFD87763A7654A9D19CE22E17_1545152099711_D8D4CC2D-B12C-4F62-9C74-EB971DAA4A33.JPG\">\n<img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_BBADC2FA0CDB08BF625CFAE1CB0CBB82FDB55E3EFD87763A7654A9D19CE22E17_1545152098854_8C4CDB9A-7866-485E-9E3A-CB70A43495D7.JPG\"></p>\n<p>By the time we reached Matt we were adequately behind schedule. It was almost 4:30, an hour before sunset, and we had a solid 4-5 miles to go. Time to haul. Into the valley we descended. Because we had cached water near this area, we had our bearings enough to realize we need to make it to the other side of a butte that looked impossibly far away. How could we cover that distance in only an hour? Best not to think about it too hard, I figured.</p>\n<p>We made good time, and before long we had made it much further than expected. The Wilson Homer Ranch house appeared as if from thin air. We had essentially complete our second day. After picking up our cached water, we stumbled a little further up the trail in limited light until we arrived at the first campsite. After a Chilly Mac and Beef dinner, we tucked in for another early night.</p>","frontmatter":{"date":"December 20, 2018","path":"/blog/big-bend-2018","title":"Big Bend National Park 🏜"}}},"pageContext":{}}